import cv2
import numpy as np

img = np.full((500, 500, 3), 255, dtype=np.uint8)    # 흰 바탕 이미지 생성

# 원중심 (150,150), 반지름 100 
cv2.circle(img, (150, 150), 100, (255,0,0))
# 원중심(300,150), 반지름 70 
cv2.circle(img, (300, 150), 70, (0,255,0), 5)   
# 원중심(400,150), 반지름 50, 채우기 
cv2.circle(img, (400, 150), 50, (0,0,255), -1)  

# 타원 중심 (80,300), 반지름 (50, 50), 회전 0도, 각도(0 ~ 360) 
cv2.ellipse(img, (80, 300), (50, 50), 0, 0, 360, (0,0,255))    
# 타원 중심 (220, 300), 반지름 (70, 50), 회전 0도, 각도(0 ~ 360) 
cv2.ellipse(img, (220, 300), (70, 50), 0, 0, 360, (255,0,0)) 
# 타원 중심(400, 300), 반지름(70, 50), 회전 0도, 각도(0 ~ 270), 채우기
cv2.ellipse(img, (400, 300), (70, 50), 0, 0, 270, (0,255,0), -1)    
  

# 타원중심 (100, 425), 반지름(50,70), 회전 45도 
cv2.ellipse(img, (100, 425), (50, 70), 45, 0, 360, (0,0,0))    
# 타원중심 (250,425), 홀쭉한 타원 45도 회전 후 아랫 반원 그리기 
cv2.ellipse(img, (300, 425), (50, 70), 45, 0, 180, (0,0,255))    
# 타원중심 (400,425), 홀쭉한 타원 45도 회전 후 윗 반원 그리기 
cv2.ellipse(img, (400, 425), (50, 70), 45, 181, 360, (255,0,0), -1)    

cv2.imshow('circle', img)
cv2.waitKey(0)
cv2.destroyAllWindows()


  


 
